DATE_YEAR = ['初级', '经典级', '高级', '总决赛']
DATE_MONTH = ['出道前', '1月上半月', '1月下半月', '2月上半月', '2月下半月', '3月上半月', '3月下半月', '4月上半月', '4月下半月',
              '5月上半月', '5月下半月', '6月上半月', '6月下半月', '7月上半月', '7月下半月',
              '8月上半月', '8月下半月', '9月上半月', '9月下半月', '10月上半月', '10月下半月', '11月上半月', '11月下半月', '12月上半月',
              '12月下半月']

# SKILL_LEARN_PRIORITY_LIST = [
#     [
#         '圆弧艺术家', '迅疾如风', '一阵狂风', '曲线行家'
#     ],
#     [
#         '专注力', '回避失速优俊少女', '临机应变', '位置感', '直线能手', '竭尽全力', '优俊少女爱好者', '登山家', '打基础', '翘尾巴', '临危不乱', '加快步伐',
#         '最后冲刺', '弯道恢复'
#     ]

# ]

SKILL_LEARN_PRIORITY_LIST = [
    [
        '打基础', '翘尾巴', '夏季优俊少女','逆时针','吞噬速度','逃亡者','游戏到此为止'
    ],
	[
		'领跑直线','领跑弯道','英里直线','英里弯道','弧线大师'
    ],
	[
		'抢先','疾步','东京赛场','晴天'
    ],
    [
        '专注力', '回避失速优俊少女', '临机应变', '位置感', '直线能手', '竭尽全力', '优俊少女爱好者', '登山家', '临危不乱', '加快步伐',
        '最后冲刺', '弯道恢复','圆弧艺术家', '迅疾如风', '一阵狂风', '曲线行家'
    ]

]

SKILL_CAN_MULTI_LEARN_LIST = [
	'顺时针','逆时针',
	'东京赛场','中山赛场','阪神赛场','京都赛场','中京赛场','札幌赛场','函馆赛场','松浪赛场','新潟赛场','小仓赛场','大井赛场',
	'标准距离','非标准距离',
	'良场地','路况不佳',
	'春季优俊少女','夏季优俊少女','秋季优俊少女','冬季优俊少女',
    '晴天','阴天','雨天','雪天',
	'擅长内道','擅长外道',
	'短距离直线','短距离弯道',
	'英里直线','英里弯道',
	'中距离直线','中距离弯道',
    '长距离直线','长距离弯道',
	'领跑直线','领跑弯道',
	'跟前直线','跟前弯道',
	'居中直线','居中弯道',
	'后追直线','后追弯道',
	'领跑诀窍','跟前诀窍','居中诀窍','后追诀窍',
]
